{
  "format": "layers-model",
  "generatedBy": "keras v3-to-tfjs-layers conversion",
  "convertedBy": "TensorFlow.js Converter v4.0.0",
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "sequential",
      "layers": [
        {
          "class_name": "Dense",
          "config": {
            "units": 10,
            "activation": "softmax",
            "name": "output_layer"
          }
        }
      ]
    }
  },
  "weightsManifest": [
    {
      "paths": [
        "weights.bin"
      ],
      "weights": [
        {
          "name": "output_layer/kernel",
          "shape": [
            150528,
            10
          ],
          "dtype": "float32"
        },
        {
          "name": "output_layer/bias",
          "shape": [
            10
          ],
          "dtype": "float32"
        }
      ]
    }
  ]
}